# Ways Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..Ways Property
ElectricalSystem Class See Also
---
The circuit ways used in the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public int Ways { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Ways As Integer
	Get
```

Visual C++
---
```text
public:
property int Ways {
	int get ();
}
```

# Remarks
This property is used to retrieve the ways of the Electrical System on a panel.
# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace